app/controllers/albums_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `albums` WHERE (`albums`.user_id = 1) ORDER BY created_at DESC
---
  def index
    @user = User.find(params[:user_id])
    @albums = @user.albums.find(:all, :order => 'created_at DESC')

SELECT * FROM `users` WHERE (`users`.`id` = 1)
INSERT INTO `albums` (`name`, `created_at`, `updated_at`, `user_id`, `description`, `photos_count`) VALUES('aaaa', '2009-03-16 05:05:08', '2009-03-16 05:05:08', 1, 'sfsdf', 0)
---
  def create
    @user = User.find(params[:user_id])
    @album = @user.albums.new(params[:album])

    if @album.save

SELECT * FROM `albums` WHERE (`albums`.`id` = 2)
---
  def edit
    @album = Album.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `albums` WHERE (`albums`.`id` = 2)
UPDATE `albums` SET `updated_at` = '2009-03-16 06:27:39', `description` = 'aaaa\'s album\'s' WHERE `id` = 2
---
  def update
    @user = User.find(params[:user_id])
    @album = Album.find(params[:id])

    if @album.update_attributes(params[:album])

SELECT * FROM `albums` WHERE (`albums`.`id` = 4)
DELETE FROM `albums` WHERE `id` = 4
---
  def destroy
    @album = Album.find(params[:id])
    @album.destroy