app/controllers/comments_controller.rb

SELECT * FROM `entries` WHERE (`entries`.`id` = 3)
INSERT INTO `comments` (`entry_id`, `created_at`, `updated_at`, `user_id`, `content`, `photo_id`) VALUES(3, '2009-03-16 09:38:25', '2009-03-16 09:38:25', 1, 'sdfsdfsdf', NULL)
UPDATE `entries` SET `comments_count` = COALESCE(`comments_count`, 0) + 1 WHERE (`id` = 3)
SELECT * FROM `photos` WHERE (`photos`.`id` = 16)
UPDATE `photos` SET `comments_count` = COALESCE(`comments_count`, 0) + 1 WHERE (`id` = 16)
---
  def create
    user_data = { :user_id => params[:user_id] }
    case params[:switch]
    when 'entry'
      @entry = Entry.find(params[:entry_id])
      @comment = @entry.comments.create(params[:comment].merge(user_data))
      if @comment.save
        redirect_to user_entry_path(:id => @comment.entry_id, :user_id => @entry.user)
      end
    when 'photo'
      @photo = Photo.find(params[:photo_id])
      @comment = @photo.comments.create(params[:comment].merge(user_data))
      if @comment.save

SELECT * FROM `comments` WHERE (`comments`.`id` = 6 AND (`comments`.photo_id = 16))
SELECT * FROM `photos` WHERE (`photos`.`id` = 16)
DELETE FROM `comments` WHERE `id` = 6
---
  def destroy
    @comment = Comment.find(params[:id])
    if @comment.entry_id.nil?
      @photo = Photo.find(params[:photo_id])
      @photo_comment = @photo.comments.find(params[:id])
      @photo_comment.destroy