app/controllers/entries_controller.rb

  def index
    @user = User.find(params[:user_id])
    @entries = @user.entries.find(:all, :order => 'created_at DESC')
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `entries` WHERE (`entries`.user_id = 1) ORDER BY created_at DESC

  def new
    @entry = Entry.new
    @user = User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)

  def create
    @user = User.find(params[:user_id])
    @entry = @user.entries.new(params[:entry])
    if @entry.save
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
INSERT INTO `entries` (`created_at`, `title`, `updated_at`, `user_id`, `entry_category_id`, `content`, `comments_count`) VALUES('2009-03-16 09:52:17', 'adfsdf', '2009-03-16 09:52:17', 1, NULL, 'sdfsdfsdf', 0)

  def show
    #@user = User.find(params[:user_id])
    @entry = Entry.find(params[:id])
    @comments = @entry.comments.find(:all, :order => 'created_at DESC')
---
SELECT * FROM `entries` WHERE (`entries`.`id` = 2)
SELECT * FROM `comments` WHERE (`comments`.entry_id = 3) ORDER BY created_at DESC

  def edit
    @entry = Entry.find(params[:id])
---
SELECT * FROM `entries` WHERE (`entries`.`id` = 2)

  def destroy
    @entry = Entry.find(params[:id])
    @entry.destroy
---
SELECT * FROM `entries` WHERE (`entries`.`id` = 2)
DELETE FROM `entries` WHERE `id` = 2