app/controllers/photos_controller.rb

  def index
    @album = Album.find(params[:album_id])
---
SELECT * FROM `albums` WHERE (`albums`.`id` = 1)

  def create
    @user = User.find(params[:user_id])
    user_data = { :user_id => @user.id }
    @album = Album.find(params[:album_id])
    @photo = @album.photos.new(params[:photo].merge(user_data))

    if @photo.save
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `albums` WHERE (`albums`.`id` = 1)
INSERT INTO `photos` (`size`, `created_at`, `album_id`, `title`, `content_type`, `thumbnail`, `updated_at`, `primary`, `avatar`, `user_id`, `parent_id`, `filename`, `height`, `description`, `comments_count`, `width`) VALUES(1986, '2009-03-16 09:51:05', 5, '360', 'image/gif', NULL, '2009-03-16 09:51:05', NULL, NULL, 1, NULL, '360.gif', 75, 'fghgfh', 0, 60)

  def show
    @photo = Photo.find(params[:id])
    @comments = @photo.comments.find(:all, :order => 'created_at desc')
---
SELECT * FROM `photos` WHERE (`photos`.user_id = 1 AND (photos.avatar = 1)) LIMIT 1
SELECT * FROM `comments` WHERE (`comments`.photo_id = 16) ORDER BY created_at desc

  def edit
    @photo = Photo.find(params[:id])
---
SELECT * FROM `photos` WHERE (`photos`.`id` = 10)

  def destroy
    @photo = Photo.find(params[:id])
    @photo.destroy
---
SELECT * FROM `photos` WHERE (`photos`.parent_id = 1)
DELETE FROM `photos` WHERE `id` = 2

  def set_primary
    @photo = Photo.find(params[:id])
    @user = User.find(params[:user_id])
    @album = @user.albums.find(params[:album_id])
    @old_primary = @album.photos.select(&:primary?)

    if @photo.update_attributes(:primary => true)
      @old_primary.each { |p| p.update_attributes!(:primary => false) }
---
SELECT * FROM `photos` WHERE (`photos`.album_id = 1)
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `albums` WHERE (`albums`.`id` = 1 AND (`albums`.user_id = 1))
UPDATE `photos` SET `updated_at` = '2009-03-16 05:33:11', `primary` = 1 WHERE `id` = 4
UPDATE `albums` SET `photos_count` = COALESCE(`photos_count`, 0) - 1 WHERE (`id` = 1)

  def set_avatar
    @photo = Photo.find(params[:id])
    @old_avatar = logged_in_user.photos.select(&:avatar?)

    if @photo.update_attributes(:avatar => true)
      @old_avatar.each { |p| p.update_attributes!(:avatar => false) }
---
UPDATE `users` SET `photos_count` = COALESCE(`photos_count`, 0) - 1 WHERE (`id` = 1)