app/controllers/users_controller.rb

INSERT INTO `users` (`salt`, `grade`, `created_at`, `updated_at`, `username`, `hashed_password`, `entries_count`, `score`, `albums_count`, `nike`, `email`, `photos_count`) VALUES('3533768100.258875322338716', '1', '2009-03-16 04:03:55', '2009-03-16 04:03:55', '1111', '04a43189b807af2bc090ab848d3b1825b5d101d4', NULL, 10, NULL, '1111', '1111@126.com', NULL)
---
  def create
    @user = User.create(params[:user])